In [12]:
import pandas as pd
import datetime as dt

In [2]:
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-03-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

In [3]:
activity

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-03-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [7]:
player_first_login = activity.groupby("player_id")["event_date"].min().reset_index()
player_first_login

   player_id event_date
0          1 2016-03-01
1          2 2017-06-25
2          3 2016-03-02

In [14]:
player_first_login['next_day'] = player_first_login["event_date"].apply(lambda x: x + dt.timedelta(days=1))
player_first_login

   player_id event_date   next_day
0          1 2016-03-01 2016-03-02
1          2 2017-06-25 2017-06-26
2          3 2016-03-02 2016-03-03

In [15]:
left_join = player_first_login.merge(activity, left_on=["player_id", "next_day"], right_on=["player_id", "event_date"])

In [16]:
left_join

,player_id,event_date_x,next_day,device_id,event_date_y,games_played,prev_event_date
0,1,2016-03-01,2016-03-02,2,2016-03-02,6,2016-03-01

In [22]:
pd.DataFrame(data=round(left_join["player_id"].drop_duplicates().count() / activity["player_id"].drop_duplicates().count(), 2), columns=["fraction"], index=[1])

   fraction
1      0.33